#+title:      A Klasse 2023-27
#+date:       [2023-07-08 Sa 14:38]
#+filetags:   :1a:Project:
#+identifier: 20230708T143857
#+CATEGORY: golling

* 1a 07:45-08:35
<%%(org-class 2022 9 12 2023 7 3 1 27)>

* 1a 07:45-08:35
<%%(org-class 2022 9 12 2023 7 3 1 27)>

* 1A MINT [KV Mirjam Seiwald]
#+Name: 2021-students
| First      | Last        | Name                 | Note | Mitarbeit | Heft | LZK |
|------------+-------------+----------------------+------+-----------+------+-----|
| Jakob      | Astner      | [[Jakob Astner][Jakob Astner]]         |    1 |           |      |     |
| Can        | Bayraktar   | [[Can Bayraktar][Can Bayraktar]]        |    1 |           |      |     |
| Philipp    | Breinlinger | [[Philipp Breinlinger][Philipp Breinlinger]]  |    1 |           |      |     |
| Alma       | Entfellner  | [[Alma Entfellner][Alma Entfellner]]      |    1 |           |      |     |
| Peter      | Harlander   | [[Peter Harlander][Peter Harlander]]      |    1 |           |      |     |
| Ivelin     | Ivanov      | [[Ivelin Ivanov][Ivelin Ivanov]]        |    1 |           |      |     |
| Lea        | Kainhofer   | [[Lea Kainhofer][Lea Kainhofer]]        |    1 |           |      |     |
| Emilia     | Loidl       | [[Emilia Loidl][Emilia Loidl]]         |    1 |           |      |     |
| Malena     | Müller      | [[Malena Müller][Malena Müller]]        |    1 |           |      |     |
| Anna-Lena  | Oberhauser  | [[Anna-Lena Oberhauser][Anna-Lena Oberhauser]] |    1 |           |      |     |
| Moritz     | Russegger   | [[Moritz Russegger][Moritz Russegger]]     |    1 |           |      |     |
| Nina       | Sattlberger | [[Nina Sattlberger][Nina Sattlberger]]     |    1 |           |      |     |
| Ana        | Sokic       | [[Ana Sokic][Ana Sokic]]            |    1 |           |      |     |
| Tobias     | Starzacher  | [[Tobias Starzacher][Tobias Starzacher]]    |    1 |           |      |     |
| Maximilian | Wallmann    | [[Maximilian Wallmann][Maximilian Wallmann]]  |    1 |           |      |     |
|------------+-------------+----------------------+------+-----------+------+-----|
#+TBLFM: $4=vmean($5..$>)
#+TBLFM: $3='(concat "[[" $1 " " $2 "][" $1 " " $2 "]]")
#+TBLFM: $5='(identity remote(2021-22-Mitarbeit,@@#$2))

#+BEGIN_SRC python :var table=2021-students :results output raw
  print('* Mitarbeit')
  for student in table:
      first = student[0]
      last = student[1]
      email = first + '.' + last + '@golling.schule'
      print('** ' + first + ' ' + last + '')
      print(':PROPERTIES:')
      print(':EMAIL: ' '[[mailto: ' + first + ' ' + last + ' <' + email + '>]]')
      print(':END: ')
      print('\n\n')
#+END_SRC

#+RESULTS:
* Mitarbeit

#+Name: Mitarbeit
| Name                 | Note | 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 | 9 | 10 |
|----------------------+------+---+---+---+---+---+---+---+---+---+----|
| [[Jakob Astner][Jakob Astner]]         |      |   |   |   |   |   |   |   |   |   |    |
| [[Can Bayraktar][Can Bayraktar]]        |      |   |   |   |   |   |   |   |   |   |    |
| [[Philipp Breinlinger][Philipp Breinlinger]]  |      |   |   |   |   |   |   |   |   |   |    |
| [[Alma Entfellner][Alma Entfellner]]      |      |   |   |   |   |   |   |   |   |   |    |
| [[Peter Harlander][Peter Harlander]]      |      |   |   |   |   |   |   |   |   |   |    |
| [[Ivelin Ivanov][Ivelin Ivanov]]        |      |   |   |   |   |   |   |   |   |   |    |
| [[Lea Kainhofer][Lea Kainhofer]]        |      |   |   |   |   |   |   |   |   |   |    |
| [[Emilia Loidl][Emilia Loidl]]         |      |   |   |   |   |   |   |   |   |   |    |
| [[Malena Müller][Malena Müller]]        |      |   |   |   |   |   |   |   |   |   |    |
| [[Anna-Lena Oberhauser][Anna-Lena Oberhauser]] |      |   |   |   |   |   |   |   |   |   |    |
| [[Moritz Russegger][Moritz Russegger]]     |      |   |   |   |   |   |   |   |   |   |    |
| [[Nina Sattlberger][Nina Sattlberger]]     |      |   |   |   |   |   |   |   |   |   |    |
| [[Ana Sokic][Ana Sokic]]            |      |   |   |   |   |   |   |   |   |   |    |
| [[Tobias Starzacher][Tobias Starzacher]]    |      |   |   |   |   |   |   |   |   |   |    |
| [[Maximilian Wallmann][Maximilian Wallmann]]  |      |   |   |   |   |   |   |   |   |   |    |
#+TBLFM: $2=vmean($3..$>)
#+TBLFM: $1='(identity remote(2021-students,@@#$3))

** Jakob Astner
:PROPERTIES:
:EMAIL: [[mailto: Jakob Astner <Jakob.Astner@golling.schule>]]
:END: 



** Can Bayraktar
:PROPERTIES:
:EMAIL: [[mailto: Can Bayraktar <Can.Bayraktar@golling.schule>]]
:END: 



** Philipp Breinlinger
:PROPERTIES:
:EMAIL: [[mailto: Philipp Breinlinger <Philipp.Breinlinger@golling.schule>]]
:END: 



** Alma Entfellner
:PROPERTIES:
:EMAIL: [[mailto: Alma Entfellner <Alma.Entfellner@golling.schule>]]
:END: 



** Peter Harlander
:PROPERTIES:
:EMAIL: [[mailto: Peter Harlander <Peter.Harlander@golling.schule>]]
:END: 



** Ivelin Ivanov
:PROPERTIES:
:EMAIL: [[mailto: Ivelin Ivanov <Ivelin.Ivanov@golling.schule>]]
:END: 



** Lea Kainhofer
:PROPERTIES:
:EMAIL: [[mailto: Lea Kainhofer <Lea.Kainhofer@golling.schule>]]
:END: 



** Emilia Loidl
:PROPERTIES:
:EMAIL: [[mailto: Emilia Loidl <Emilia.Loidl@golling.schule>]]
:END: 



** Malena Müller
:PROPERTIES:
:EMAIL: [[mailto: Malena Müller <Malena.Müller@golling.schule>]]
:END: 



** Anna-Lena Oberhauser
:PROPERTIES:
:EMAIL: [[mailto: Anna-Lena Oberhauser <Anna-Lena.Oberhauser@golling.schule>]]
:END: 



** Moritz Russegger
:PROPERTIES:
:EMAIL: [[mailto: Moritz Russegger <Moritz.Russegger@golling.schule>]]
:END: 



** Nina Sattlberger
:PROPERTIES:
:EMAIL: [[mailto: Nina Sattlberger <Nina.Sattlberger@golling.schule>]]
:END: 



** Ana Sokic
:PROPERTIES:
:EMAIL: [[mailto: Ana Sokic <Ana.Sokic@golling.schule>]]
:END: 



** Tobias Starzacher
:PROPERTIES:
:EMAIL: [[mailto: Tobias Starzacher <Tobias.Starzacher@golling.schule>]]
:END: 



** Maximilian Wallmann
:PROPERTIES:
:EMAIL: [[mailto: Maximilian Wallmann <Maximilian.Wallmann@golling.schule>]]
:END: 





* Reflexionen

